# matric = [
#     [0, 1, 0, 0, 0, 0, 0],# 0 
#     [1, 0, 1, 0, 0, 0, 0],# 1
#     [0, 1, 0, 0, 0, 0, 0],# 2
#     [0, 0, 1, 0, 1, 0, 0],# 3
#     [0, 0, 0, 0, 0, 1, 0],# 4
#     [0, 0, 0, 0, 1, 0, 1],# 5
#     [0, 0, 0, 0, 0, 1, 0] # 6
#     ]
matric = [
    [0, 0, 0, 0, 0, 0, 0],# 0 
    [1, 0, 1, 0, 0, 0, 0],# 1
    [0, 0, 0, 0, 0, 0, 0],# 2
    [0, 1, 0, 0, 0, 1, 0],# 3
    [0, 0, 0, 0, 0, 0, 0],# 4
    [0, 0, 0, 0, 1, 0, 1],# 5
    [0, 0, 0, 0, 0, 0, 0]# 6
    ]

visited = [False] * 7

def dfs(nowNode):
    visited[nowNode] = True
    ## 전위 프린트 공간
    #print(nowNode, end=' ')
    for one in range(len(matric)):
        if matric[nowNode][one] != 0:
            dfs(one)
    ## 후위 프린트 공간
    #print(nowNode, end=' ')

dfs(3)